circular-cylinder-re20-A/system/blockMeshDict
// Mesh generated on 08-Mar-2021
// Local directory: /Users/lukewilson/OneDrive/sp22/coe347/openfoam2/
// Username: lew2547


// Lf (fore)  =  4.00000e+00
// Lw (wake)  =  6.00000e+00
// R  (outer) =  1.00000e+00
// H  (top/bottom) = 4.00000

FoamFile
{
	version  2.0;
	format   ascii;
	class    dictionary;
	object   blockMeshDict;
}

convertToMeters 1.0;

verticies
(
	( +5.000000e-01 +0.000000e+00 -5.000000e-02 ) // 0
	( +3.535534e-01 +3.535534e-01 -5.000000e-02 ) // 1
	( +3.061617e-17 +5.000000e-01 -5.000000e-02 ) // 2
	( -3.535534e-01 +3.535534e-01 -5.000000e-02 ) // 3
	( -5.000000e-01 +6.123234e-17 -5.000000e-02 ) // 4
	( -3.535534e-01 -3.535534e-01 -5.000000e-02 ) // 5
	( -9.184851e-17 -5.000000e-01 -5.000000e-02 ) // 6
	( +3.535534e-01 -3.535534e-01 -5.000000e-02 ) // 7
	( +1.000000e+00 +0.000000e+00 -5.000000e-02 ) // 8
	( +7.071068e-01 +7.071068e-01 -5.000000e-02 ) // 9
	( +6.123234e-17 +1.000000e+00 -5.000000e-02 ) // 10
	( -7.071068e-01 +7.071068e-01 -5.000000e-02 ) // 11
	( -1.000000e+00 +1.224647e-16 -5.000000e-02 ) // 12
	( -7.071068e-01 -7.071068e-01 -5.000000e-02 ) // 13
	( -1.836970e-16 -1.000000e+00 -5.000000e-02 ) // 14
	( +7.071068e-01 -7.071068e-01 -5.000000e-02 ) // 15
	( +4.000000e+00 +0.000000e+00 -5.000000e-02 ) // 16
	( +4.000000e+00 +7.071068e-01 -5.000000e-02 ) // 17
	( +4.000000e+00 +4.000000e+00 -5.000000e-02 ) // 18
	( +7.071068e-01 +4.000000e+00 -5.000000e-02 ) // 19
	( +0.000000e+00 +4.000000e+00 -5.000000e-02 ) // 20
	( -7.071068e-01 +4.000000e+00 -5.000000e-02 ) // 21
	( -4.000000e+00 +4.000000e+00 -5.000000e-02 ) // 22
	( -4.000000e+00 +7.071068e-01 -5.000000e-02 ) // 23
	( -4.000000e+00 +0.000000e+00 -5.000000e-02 ) // 24
	( -4.000000e+00 -7.071068e-01 -5.000000e-02 ) // 25
	( -4.000000e+00 -4.000000e+00 -5.000000e-02 ) // 26
	( -7.071068e-01 -4.000000e+00 -5.000000e-02 ) // 27
	( +0.000000e+00 -4.000000e+00 -5.000000e-02 ) // 28
	( +7.071068e-01 -4.000000e+00 -5.000000e-02 ) // 29
	( +4.000000e+00 -4.000000e+00 -5.000000e-02 ) // 30
	( +4.000000e+00 -7.071068e-01 -5.000000e-02 ) // 31
	( +5.000000e-01 +0.000000e+00 +5.000000e-02 ) // 32
	( +3.535534e-01 +3.535534e-01 +5.000000e-02 ) // 33
	( +3.061617e-17 +5.000000e-01 +5.000000e-02 ) // 34
	( -3.535534e-01 +3.535534e-01 +5.000000e-02 ) // 35
	( -5.000000e-01 +6.123234e-17 +5.000000e-02 ) // 36
	( -3.535534e-01 -3.535534e-01 +5.000000e-02 ) // 37
	( -9.184851e-17 -5.000000e-01 +5.000000e-02 ) // 38
	( +3.535534e-01 -3.535534e-01 +5.000000e-02 ) // 39
	( +1.000000e+00 +0.000000e+00 +5.000000e-02 ) // 40
	( +7.071068e-01 +7.071068e-01 +5.000000e-02 ) // 41
	( +6.123234e-17 +1.000000e+00 +5.000000e-02 ) // 42
	( -7.071068e-01 +7.071068e-01 +5.000000e-02 ) // 43
	( -1.000000e+00 +1.224647e-16 +5.000000e-02 ) // 44
	( -7.071068e-01 -7.071068e-01 +5.000000e-02 ) // 45
	( -1.836970e-16 -1.000000e+00 +5.000000e-02 ) // 46
	( +7.071068e-01 -7.071068e-01 +5.000000e-02 ) // 47
	( +4.000000e+00 +0.000000e+00 +5.000000e-02 ) // 48
	( +4.000000e+00 +7.071068e-01 +5.000000e-02 ) // 49
	( +4.000000e+00 +4.000000e+00 +5.000000e-02 ) // 50
	( +7.071068e-01 +4.000000e+00 +5.000000e-02 ) // 51
	( +0.000000e+00 +4.000000e+00 +5.000000e-02 ) // 52
	( -7.071068e-01 +4.000000e+00 +5.000000e-02 ) // 53
	( -4.000000e+00 +4.000000e+00 +5.000000e-02 ) // 54
	( -4.000000e+00 +7.071068e-01 +5.000000e-02 ) // 55
	( -4.000000e+00 +0.000000e+00 +5.000000e-02 ) // 56
	( -4.000000e+00 -7.071068e-01 +5.000000e-02 ) // 57
	( -4.000000e+00 -4.000000e+00 +5.000000e-02 ) // 58
	( -7.071068e-01 -4.000000e+00 +5.000000e-02 ) // 59
	( +0.000000e+00 -4.000000e+00 +5.000000e-02 ) // 60
	( +7.071068e-01 -4.000000e+00 +5.000000e-02 ) // 61
	( +4.000000e+00 -4.000000e+00 +5.000000e-02 ) // 62
	( +4.000000e+00 -7.071068e-01 +5.000000e-02 ) // 63
);

blocks
(

	// block 0 
	hex ( 0  8  9  1 32 40 41 33) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 1 
	hex ( 1  9 10  2 33 41 42 34) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 2 
	hex ( 2 10 11  3 34 42 43 35) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 3 
	hex ( 3 11 12  4 35 43 44 36) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 4 
	hex ( 4 12 13  5 36 44 45 37) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 5 
	hex ( 5 13 14  6 37 45 46 38) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 6 
	hex ( 6 14 15  7 38 46 47 39) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 7 
	hex ( 7 15  8  0 39 47 40 32) ( 10 20  1) simpleGrading ( +2.000000e+00 +1.000000e+00 1.0)
	// block 8 
	hex ( 8 16 17  9 40 48 49 41) ( 30 20  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 9 
	hex ( 9 17 18 19 41 49 50 51) ( 30 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 10 
	hex (10  9 19 20 42 41 51 52) ( 20 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 11 
	hex (11 10 20 21 43 42 52 53) ( 20 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 12 
	hex (23 11 21 22 55 43 53 54) ( 15 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 13 
	hex (24 12 11 23 56 44 43 55) ( 15 20  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 14 
	hex (25 13 12 24 57 45 44 56) ( 15 20  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 15 
	hex (26 27 13 25 58 59 45 57) ( 15 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 16 
	hex (27 28 14 13 59 60 46 45) ( 20 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 17 
	hex (28 29 15 14 60 61 47 46) ( 20 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 18 
	hex (29 30 31 15 61 62 63 47) ( 30 30  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)
	// block 19 
	hex (15 31 16  8 47 63 48 40) ( 30 20  1) simpleGrading ( +1.000000e+00 +1.000000e+00 1.0)

);

edges
(

arc  0  1 ( +4.619398e-01 +1.913417e-01 -5.000000e-01 )
arc  8  9 ( +9.238795e-01 +3.826834e-01 -5.000000e-01 )
arc 32 33 ( +4.619398e-01 +1.913417e-01 +5.000000e-01 )
arc 40 41 ( +9.238795e-01 +3.826834e-01 +5.000000e-01 )
arc  1  2 ( +1.913417e-01 +4.619398e-01 -5.000000e-01 )
arc  9 10 ( +3.826834e-01 +9.238795e-01 -5.000000e-01 )
arc 33 34 ( +1.913417e-01 +4.619398e-01 +5.000000e-01 )
arc 41 42 ( +3.826834e-01 +9.238795e-01 +5.000000e-01 )
arc  2  3 ( -1.913417e-01 +4.619398e-01 -5.000000e-01 )
arc 10 11 ( -3.826834e-01 +9.238795e-01 -5.000000e-01 )
arc 34 35 ( -1.913417e-01 +4.619398e-01 +5.000000e-01 )
arc 42 43 ( -3.826834e-01 +9.238795e-01 +5.000000e-01 )
arc  3  4 ( -4.619398e-01 +1.913417e-01 -5.000000e-01 )
arc 11 12 ( -9.238795e-01 +3.826834e-01 -5.000000e-01 )
arc 35 36 ( -4.619398e-01 +1.913417e-01 +5.000000e-01 )
arc 43 44 ( -9.238795e-01 +3.826834e-01 +5.000000e-01 )
arc  4  5 ( -4.619398e-01 -1.913417e-01 -5.000000e-01 )
arc 12 13 ( -9.238795e-01 -3.826834e-01 -5.000000e-01 )
arc 36 37 ( -4.619398e-01 -1.913417e-01 +5.000000e-01 )
arc 44 45 ( -9.238795e-01 -3.826834e-01 +5.000000e-01 )
arc  5  6 ( -1.913417e-01 -4.619398e-01 -5.000000e-01 )
arc 13 14 ( -3.826834e-01 -9.238795e-01 -5.000000e-01 )
arc 37 38 ( -1.913417e-01 -4.619398e-01 +5.000000e-01 )
arc 45 46 ( -3.826834e-01 -9.238795e-01 +5.000000e-01 )
arc  6  7 ( +1.913417e-01 -4.619398e-01 -5.000000e-01 )
arc 14 15 ( +3.826834e-01 -9.238795e-01 -5.000000e-01 )
arc 38 39 ( +1.913417e-01 -4.619398e-01 +5.000000e-01 )
arc 46 47 ( +3.826834e-01 -9.238795e-01 +5.000000e-01 )
arc  7  0 ( +4.619398e-01 -1.913417e-01 -5.000000e-01 )
arc 15  8 ( +9.238795e-01 -3.826834e-01 -5.000000e-01 )
arc 39 32 ( +4.619398e-01 -1.913417e-01 +5.000000e-01 )
arc 47 40 ( +9.238795e-01 -3.826834e-01 +5.000000e-01 )


);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			(23 24 25 26)
			(54 55 56 57)
			(55 56 57 58)
			(22 23 24 25)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(16 17 30 31)
			(49 50 63 48)
			(48 49 62 63)
			(17 18 31 16)
		);
	}

	cylinder
	{
		type wall;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 8  9 10 11)
			(12 13 14 15)
			(16 17 18 19)
			(20 21 22 23)
			( 1  2  3  4)
			( 5  6  7  0)
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			(18 19 20 21)
			(51 52 53 54)
			(50 51 52 53)
			(19 20 21 22)
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			(26 27 28 29)
			(58 59 60 61)
			(59 60 61 62)
			(27 28 29 30)
		);
	}

);